#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "1a9187caf07e598a164478d42fa8fe80" -> "4f98e6fdb8f82c6220abef120e1b9bf0"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "138fce208455867cdf795c2157cedc06" -> "0d3bdf35f53d13f9ecb81e915e7066b2"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "c1123ff65e58455c2803610a9c139e22" -> "f5825d8a5ea3426e31b3dc284ec5213c"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "fdb22b03186e034d2f3ad36a8ac9c359" -> "ebfcab08b4b1d2999c1f69e7ec81d252"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "a231e48c3825c28030c27db9e0762522" -> "916d05257f129832a8fccbf3c41dc0da"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "3c74802ac168ad18370a9f18da5daf4a" -> "dc136d01ed1522a87ea7ce1faaf0b8f3"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "7780a3644ae34baea4133c41027a1077" -> "6b6c940f52b7f8033119f598cbc7ca49"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "299797f3ff7c4db9b9ef89e470a3f2dd" -> "bf67ad7aea206e86fe90b7052177e984"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "a74f9553df3db6adf2f153d872e8d860" -> "28ca6af36ab5893b43ac4ff3b3261905"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "a9e96dbf874739ace423d7db4b349a24" -> "90ecfc3c5b37f47cc55d37019f3c142c"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "d6a908d8bd9812de11063cc3b8c9aee9" -> "8f6fc4400b69f51219ce402afded1752"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "f3eb11b6122a44e7bf9e19a19bfed129" -> "98cf8a92d79d61feff68f55dd069f600"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "099462c75bbc35aad64420b3abc39b52" -> "6508689e08efda8b080a6b46ff487b61"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "50b27f722a90029c64a48bfe8cdcf4e5" -> "0f49a96b3c84d3d43ed1643ead9f19bd"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "18ca3c99a66eb872d249c3490029ed34" -> "96b80d68d4cbaedc58ad6faaf90e4c12"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "99b554252bac292eb30aaf462d724c9e" -> "dd939f59beab5d8e6b3851464729fee6"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e18529d699f31c43c6d9eafba39d989e" -> "7a1d0a132493881ade267ad033f18f42"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "f36e8605fcd9e936796a88a406dd71b0" -> "b211da66037f5b5994f9d15106472c41"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "a5ae479002b6f16a560b5ccec763f3e7" -> "11c9663a0477fbe4f7ac52cf22ee1c2b"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "415d53d97baa11dc0dab3ba758fa7b7a" -> "30673c5fb8f75d2460127f95caaaa5a2"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "40dbf7d1124fce793d8a43a9bf521441" -> "4d2ab935bd3488340c5fc3e42034bff1"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "df9eac77089b99937a4a71d00af0b48e" -> "8df8e055810bb04cd428f03547bad318"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "4f0f4ce63589fefe35b8c48c5c86d70a" -> "3098c3106a67ca7691deee7153ab356d"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7dc88662e87e6e7761554adac895ace4" -> "49c3107f9c1b8cfc877f898cfdae6863"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "e3c8f5573556400524022efe3f0dbf15" -> "05dc0473afe6589329fd745f4ce2b53e"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "499879305c585bd5403d803e2a16f9a8" -> "6090e461458e3f62aa41ae5b1878bfd1"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "fa293ecd20f81b6c6f5c864df2e3849a" -> "44292687cad86fa0cbe8d1cd2d6c188d"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "457ef580b09d15d2671bfe6af93c51dc" -> "27c7a61d6add2cad1a937342e044760c"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "1bcc6f3537817de051ccdd97d707471f" -> "ee49c79153b38ac972e3d86f2ead0e3c"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "f6a0bcdabe4c814892d1d22a15740f60" -> "f74b8e73b81d416e7936d49cbfbcc062"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "a4cbb79da720dedc8e7544b2f15ef541" -> "e69b18aa9e7e7101fd57df0f31b65158"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ccd3aa0a1eab82590e3c7fbf6ef169d4" -> "84534a26088fea0046390e7d675ee23f"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "0e4631e01fec92596df50d2db5186c79" -> "38f352cf7f54a5ab4a13a3542d05e865"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "682e75b1caf450f69cadd1b7934c1daf" -> "0323783b5c025d4c9c4a71acb00e0540"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "c92f854ec3ab0bdbbf735bd8ad667ff9" -> "e37c3bf98a9a697a981c782783959680"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "4541bdc7d425655afc57bb6a017c4ea3" -> "d9b0b83242c9b04e408eaf0ac749fda3"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "6de3126cbc05066bef3960b24bbb456e" -> "17a333728a90689c9f43971f40b74506"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "f806ab407aa795eb4f7d6a84bb92e072" -> "c9f8a1a05200fc22c351f5a1da9c0f53"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "3fab50b2cfbee531fb8a2ec71118dd53" -> "d4803a1627600cf502f78b098f776608"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "5630e63e86ce2377129a4647f5c85211" -> "c3b1d0f9465dc1aeb3cf12fdab7067f7"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0a23d2a43a498e54f6bb0ac87e09f906" -> "8e790ee1320ee960e8d97bd8ac7cf278"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "972a8e8857b05d045f749fce9346e004" -> "29ca5147e73557c85298f8cd6ebdde9f"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "bae2aaa22e35c2804cec31aa8579115f" -> "353fb41fa9aba924408dd1c7ec408382"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "bac493b72cd8eec4a9721f85b6891615" -> "4c88926004e968be1295deba842247b9"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "ccff770714c5e867fa2c6e89d056d82c" -> "a41c6159fe45a40955afc608bacdaa25"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "29eec7318948fc39aed191b40826a4a3" -> "d2329f7eab932a4abcbb2af70be915b4"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "15d4198afe2f5f8c93f2e51736bdd5f9" -> "b771c06a579d52a6ef5f71dcdfe53355"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "VJzi2FZAjWs3gCL4yaWdfdoWVbbdeIAA8O5nCT/lSzc=" -> "Oy8saPVVQuB6ZtRzl6V3JZrUk/vimZQsDPTDOhCCwLU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "HfsPnfFwAcCKIIRR3kIvjdOVsd5kWaaRa1k/HESLvyw=" -> "WHMiAHiOVb3E7riFvPD+/8J+rRdMgKukOc8WBZBdhO4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "G0oZmQWS1IuPjJ7XxNs7Xp+P1DhHAuymm9Ke6AMC3b8=" -> "tXWBro3bFG+niwxYXlQKSI674zvdtARLKpe2yCiuqxA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "UHI16C/6AHoAq8VMWtvuAWvyRso6KO8Ytu1VazKbaPQ=" -> "R7lb1dNkmYWkUTLWh8fEKNeWMUyfm/ojP12nbDHtQ18="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "DA7Yk46+3X9vCyfgStYrt16zlwo6eBFej/SzGn5V3CQ=" -> "RrWt/afQeMOiVhJJzDE5vcujF1Qaqtlf29/JQi60flk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZo9QajI4Pyzxp7DtwGVs/lTFZbTaWFr9UVHI78fglA=" -> "1muOtSKXe7uKla05SyoVs72e90N6On8Sy+dV/YFihYA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "0k85PMPiIvePYFtySZIL7VSIFbxwnwf+B9byMlZig+Q=" -> "9YgBfIW2acpujYRrr3aNgwKhb9bElLL3Zw/o9Lamt00="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "DYbVgi+8YHrYe7pGXzrm6ek93YeV+kIHNziI1pOoGKA=" -> "gKlx4/BecKVutIgJuFR4ASUX40zW+q8H/xkTdVIITDA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "1ywQdkuBJ/nEtZV7D88RKHFha+d5qeGeQhPY/RlLyx4=" -> "AQy0YKYyF43Tl9FS05VBwSMAoC+9NiRuyi8b9puoryc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "zATW/1W49/GwSXlgtYq3Fz/UxCXmjl2FnR4LA/V9MU0=" -> "eFudAH9Vqz9sD4L0SIzL+iAFNAW8CL0DrKcrVOsvf4Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LRcZXQ0vFBCUroGE6pAw4buAhLU4IaFAGwqXFPeOKRw=" -> "eFUyKHLpA/CfBpNxEcFhO1e6VAOJ2CRPwnATGWkI0IM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "IoIDDv8t2G5DXlKnVXRmDmk27GDUHosU0swzEY63zlI=" -> "wE5A1wbnh5HLiorhWFuVWfdOakjtCIHne/l5MCAQpaY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "kx1bsToC3y2yGpUUsEeSt99ZOqrE7jTTgi8C4xBJywg=" -> "AQRERfHbAN4B+s8uZhZbCK4z8Rsd1f8Xksth3WnrG/k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "kWhev/K1zW2wAyWSh+F3gIydRp1gl6tntrag3zQ2aNA=" -> "pQiDkfhC/NeD/RYi+olqYkvJ7AFG6qUt/JLk4h3qy+k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "PX3mSayp0CcYSsyoCrhgsG6+b/OI5GE2NGGRBLAsd2o=" -> "bCMQBn9Mk7wUmSAFO5D40vAKln1dPJxzv2MkAiMg6kI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "PIPdwsYUi+hjvJSqqsojSrgWbe+RyxtU+r4cIKt459U=" -> "idCSUupDepZqduybzICPj3RTh8+J8lJC0DG/wXCPp9M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "9hP3+UGOt2c6Kl/eylW7ei7QVUWbo5HxYBDaz5DhfFA=" -> "xvFCih6RMk/3UNt8suHCrg7z0SvS/LRpTgnbaCqOO/4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "biIy3xSjWPSuEp3/1l3GyHhi+jWJkV+s/S9ffh1Mu98=" -> "YGwv3qWCFtBmylOP+DhA/9+6LYNbASnLwNkSR4IMht0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "T8xXPXa/LSn3msarzgtF5wwjfSDZCA8jew9D2VDsEuk=" -> "0izZUBmPhmKQiwqYHELwMM4yRzQFT/D4zKQrG9aNgzU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "K3ayvGV2Jes9mgXfkjcet7AvxB/TYn1f2vvNGZqTFQs=" -> "lssEOlZIX953elHpcpjsBl/p+umwkfZ6CrQO0k5QeVE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "xmG7coqLvkn5DPg+GQXITO78hcUWtDyNTjZBbqOcNwY=" -> "Lb2iiz63BOQXYU8uakWQqOtSoMyrwXemOUOHRXz0lOg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "d1nToCh0it2WqLEaIiz6XhpmzzA+AFUXiKM52Xu6U10=" -> "m+slSM5kd2Hi/qzGzAclB73Eyty0ftlX1f6c8zzaa/g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "/eQCpOiFic/fYSeHd1L5RzY32n2GqeK0klu1xWNex3M=" -> "bBjFqFyLacLInX7WJmduZS5fmuulLq5Uc4igcMyIVXk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "rARbwgGSfqLhTNTcEmUiGsaV3PJCkOxFQGErlda6Kjk=" -> "MEjZYoDne0FgxjJnpxOHoX9bKgncLgCpKa+5H/8Fd7U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "WQNRRCnvfUEauOWa55m7I+xQQuy4DA2SsYxd6GXn450=" -> "JU01CWgz2n5xOqs6YEKT5knRL/CPQjUbFu4yjeQZZj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "8N/uXKdcl83E3y6cjPq5Vo0L4RmwfJYzh/TiwZEgiKg=" -> "zhL3qXiKl1wobvtyidaS/vvAd/fIe/gQqwlqICMlpGQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "rph39hHqJYN+OXMDpQfEvT9SyudPKsQCrI09Oaszq/M=" -> "yLdDCfYFaluI7lc8NjF31BerwKmmTmkHiNs2mQ+9H2M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "LmY1896e52qDZWkI3NuDYb2Yoow4PnheJygi8KVCRpI=" -> "eJEL1toDcuvj7O/4VEGCn6RS7+KTmKjWCAc/hK1YLBY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "BMvOY6h3yZRrpu7SIO5slmo7Ub18OAmL9b0WggrrQnI=" -> "u3Z1aUMofanrNh+mL9BcERxCfAwE6/kFoGUlQAs1Hkk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "R/6dfpuTjanEVov8jgWUoe4j9L25O5nPD/r5tGB2LAU=" -> "Ql5eGN88WE1bW+xAY7VmSUjs61B3nDYBFKl9GzlpJ4k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-28T19:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZHEauuuxs7NlOwzY7a07EZZ5at4kF7q/9KBd4XXNFls=" -> "a/C3okonXbrMbLbT3QnY7nuaK2SqZ3LhSRsDgKhQmN4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "GfAOxrw/atfTjDf5Slf+h21iBbmHFZLv3AqbZoMBMqM=" -> "a9xQU5R7WunWiUh2wQZXhLvUum37c1cWoAvjm+7/gsk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "xk56/2fDVt0nFuQ4ybtFGsYQweO4dzW31fHJqjcD4UY=" -> "mxmyetnASonflbXV5WbETCjZ001AqPyuBzbqAwjdeFk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "c5A7U6aVtpRZRERXUHknoOdyggTyWKONqa/TIQOSsWE=" -> "FME5AOtS/ejj8CDXbcRHHpVAUe229IP5fk9+ikE39tU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "xj9Q2SkaEJ8dUej7DvnHDx520J0/3JZk2+VNTvta560=" -> "anTt7TcfcZS4h9jjbSRTC4DcHri1jamj4pZ849pRjec="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "+YnPZGcYbYKNbf5MEgWMNH/ayzXSQl4DCPq29cKoV7Q=" -> "tnh5DT/STPBFpkedoqVhb3E+wxDuJmJkDaybAS0EhN8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mok1sWN2I0vZpSz2LQ7Hya5Mv7+W4cTNqMS7PI+iYYY=" -> "tAU0CzwC1Vom6egkZ3Ud3nkVRj0YBdRWmrQEnbPpbVs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "MtkxsJONSm4xP2azLn7eSvAjiCLVNk04xctBr5Xp5Qw=" -> "4mvnRdfocKEzBLXCQE4zDtU8ZYJcopGhkGC5TScNfO8="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "tNJ+auMsdJIf6WNHGHUMLs73sXQZTI019JIXI0Xrlg8=" -> "2MlcNTF1qQPecXcfmRn+A1nvsVtuXzcDkdaJoHDuyOA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "/zYmg18AUpLAQ3yCgrCyAj/08/Ar41PzX3mi7sAzG1I=" -> "dcQ5/CRj7jwMY/AQoRXIpsVXboZY6PrvxYDx0sUeDJo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "gua1kqpNTQVklaE7AoOyajWYC3UgQp2oYAb0vhR/M+U=" -> "pEDMUZEiYxEY3m/ABIsXItt7bRspY6rZnd3X3qN/6Ik="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "SCgMzA5srf2nA5kfdD697XtlWOpZZzKgydItBU7vQ2M=" -> "d61uaGHrZli4Kg2LU1ByOBfWPfGMTlQPcz82UEZoTNA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ESeZnaifn72asVnZDCPDMIgKkOgXfYlm0PoEK8zuSf4=" -> "hTZ5PukBsea05pMOXBZgjVCHQP6ska83F0jfwoG4LKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "/TZ1vGdMjchIyprAh+tyg6TGcWpl3MQ7mVLbnRCgSj0=" -> "2bFZmQyf7X/1XATml9MQ56Ll7V1XqitM2RJZCl2nJ8g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "z10zdYdvtZH25sJVPWV2zeUNy14GR+P2dBQCtx1kH8I=" -> "kh6akCSpeEud3+7sSil9t39Hf2822RC1ZdWb2Zrhf6c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "a9Uhfb6/OPj58LqMguuslqsSuPPbvk66hDmDq0pJ5/Q=" -> "Vzy5tQNK2e40Sbyld581G3QSsOj5Nm18rXfxQaX9HSw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-25T06:34:22Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "edetfb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-25T06:34:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-25T06:34:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*